# Brewfile

###############################################################################
# Xcode Command‑Line Tools (not managed by Homebrew)
###############################################################################

# Mac App Store CLI to automate App Store installs
brew "mas"

# Install full Xcode (optional GUI IDE + SDKs)
mas "Xcode", id: 497799835
mas "Slack-for-Desktop", id: 803453959
mas "whatsapp-messenger", id: 310633997

###############################################################################
# 1. Core Command‑Line Tools
###############################################################################

brew "git"
brew "gh"
brew "curl"

###############################################################################
# 2. Shell & Terminal Enhancements
###############################################################################

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

###############################################################################
# 3. Programming Languages & Version Managers
###############################################################################

brew "nvm"
brew "yarn"
brew "rbenv"
brew "go"
brew "rustup-init"

cask "flutter"
cask "google-cloud-sdk"

brew "awscli"

###############################################################################
# 4. Editors & IDEs
###############################################################################

cask "visual-studio-code"
cask "android-studio"
cask "cursor"

###############################################################################
# 6. Containers & Orchestration
###############################################################################

brew "docker"
cask "docker"

###############################################################################
# 9. Mobile Development Utilities
###############################################################################

brew "cocoapods"

###############################################################################
# 11. AI & ML Frameworks & Helpers
###############################################################################

brew "jupyterlab"

###############################################################################
# 13. Requested Desktop Apps
###############################################################################

cask "claude"
cask "google-chrome"
cask "spotify"
cask "discord"
cask "todoist"
cask "chatgpt"
cask "workflowy"
cask "notion"
cask "github"
cask "signal"
cask "pgadmin4"
cask "windsurf"

# NEW, testing

brew "asdf"
brew "bat"
brew "tree"
brew "tmux"
brew "fzf"
